In [1]:
import pandas as pd
import numpy as np

In [2]:
data=np.random.randn(4,3)

In [3]:
data

array([[ 1.08686167, -0.80142667, -0.54736404],
       [-0.25822504,  0.34200827,  0.28538197],
       [ 0.4392417 , -0.90680412, -0.52953856],
       [-0.70917187,  0.92217777, -0.28013655]])

In [4]:
dataFrame=pd.DataFrame(data)

In [5]:
dataFrame

          0         1         2
0  1.086862 -0.801427 -0.547364
1 -0.258225  0.342008  0.285382
2  0.439242 -0.906804 -0.529539
3 -0.709172  0.922178 -0.280137

In [6]:
type(dataFrame)

pandas.core.frame.DataFrame

In [7]:
dataFrame[0]

0    1.086862
1   -0.258225
2    0.439242
3   -0.709172
Name: 0, dtype: float64

In [8]:
type(dataFrame[0])

pandas.core.series.Series

In [9]:
yeniDataFrame=pd.DataFrame(data,index=["a","b","c","d"],columns=["yas","maas","calisma saati"])

In [10]:
yeniDataFrame

        yas      maas  calisma saati
a  1.086862 -0.801427      -0.547364
b -0.258225  0.342008       0.285382
c  0.439242 -0.906804      -0.529539
d -0.709172  0.922178      -0.280137

In [11]:
yeniDataFrame["yas"]

a    1.086862
b   -0.258225
c    0.439242
d   -0.709172
Name: yas, dtype: float64

In [12]:
yeniDataFrame[["maas","yas"]]

       maas       yas
a -0.801427  1.086862
b  0.342008 -0.258225
c -0.906804  0.439242
d  0.922178 -0.709172

In [13]:
#sutundan bilgi almak için loc ve iloc u kullanırız
yeniDataFrame.loc["c"]

yas              0.439242
maas            -0.906804
calisma saati   -0.529539
Name: c, dtype: float64

In [14]:
yeniDataFrame.iloc[1]

yas             -0.258225
maas             0.342008
calisma saati    0.285382
Name: b, dtype: float64

In [15]:
yeniDataFrame["maas"]

a   -0.801427
b    0.342008
c   -0.906804
d    0.922178
Name: maas, dtype: float64

In [16]:
yeniDataFrame["Emekli Yasi"]=yeniDataFrame["yas"]*2 #yeni kolon ekleme

In [17]:
yeniDataFrame

        yas      maas  calisma saati  Emekli Yasi
a  1.086862 -0.801427      -0.547364     2.173723
b -0.258225  0.342008       0.285382    -0.516450
c  0.439242 -0.906804      -0.529539     0.878483
d -0.709172  0.922178      -0.280137    -1.418344

In [18]:
yeniDataFrame["tarih"]=["2010","2015","2012",2015]

In [19]:
yeniDataFrame

        yas      maas  calisma saati  Emekli Yasi tarih
a  1.086862 -0.801427      -0.547364     2.173723  2010
b -0.258225  0.342008       0.285382    -0.516450  2015
c  0.439242 -0.906804      -0.529539     0.878483  2012
d -0.709172  0.922178      -0.280137    -1.418344  2015

In [20]:
# colon silme ama "drop" kalıcı silmiyor

yeniDataFrame.drop("Emekli Yasi", axis=1)

        yas      maas  calisma saati tarih
a  1.086862 -0.801427      -0.547364  2010
b -0.258225  0.342008       0.285382  2015
c  0.439242 -0.906804      -0.529539  2012
d -0.709172  0.922178      -0.280137  2015

In [21]:
yeniDataFrame

        yas      maas  calisma saati  Emekli Yasi tarih
a  1.086862 -0.801427      -0.547364     2.173723  2010
b -0.258225  0.342008       0.285382    -0.516450  2015
c  0.439242 -0.906804      -0.529539     0.878483  2012
d -0.709172  0.922178      -0.280137    -1.418344  2015

In [22]:
# colomn u kalıcı silmek için:

yeniDataFrame.drop("Emekli Yasi",axis=1,inplace=True)

In [23]:
yeniDataFrame

        yas      maas  calisma saati tarih
a  1.086862 -0.801427      -0.547364  2010
b -0.258225  0.342008       0.285382  2015
c  0.439242 -0.906804      -0.529539  2012
d -0.709172  0.922178      -0.280137  2015

In [24]:
yeniDataFrame.loc["a"]["maas"]

-0.801426673450769

In [25]:
yeniDataFrame.loc["a","maas"]

-0.801426673450769

In [26]:
yeniDataFrame

        yas      maas  calisma saati tarih
a  1.086862 -0.801427      -0.547364  2010
b -0.258225  0.342008       0.285382  2015
c  0.439242 -0.906804      -0.529539  2012
d -0.709172  0.922178      -0.280137  2015

In [27]:
yeniDataFrame+yeniDataFrame

        yas      maas  calisma saati     tarih
a  2.173723 -1.602853      -1.094728  20102010
b -0.516450  0.684017       0.570764  20152015
c  0.878483 -1.813608      -1.059077  20122012
d -1.418344  1.844356      -0.560273      4030

In [57]:
yeniDataFrame[yeniDataFrame["calisma saati"]>0] 
#çalışma saati 0 dan büyük olanları satır şeklinde dönderir

                  yas      maas  calisma saati tarih
yeni indeks
zey         -0.258225  0.342008       0.285382  2015

In [29]:
yeniDataFrame

        yas      maas  calisma saati tarih
a  1.086862 -0.801427      -0.547364  2010
b -0.258225  0.342008       0.285382  2015
c  0.439242 -0.906804      -0.529539  2012
d -0.709172  0.922178      -0.280137  2015

In [30]:
yeniIndeksListesi=["ati","zey","atl","meh"]

In [31]:
yeniDataFrame["yeni indeks"]=yeniIndeksListesi

In [32]:
yeniDataFrame

        yas      maas  calisma saati tarih yeni indeks
a  1.086862 -0.801427      -0.547364  2010         ati
b -0.258225  0.342008       0.285382  2015         zey
c  0.439242 -0.906804      -0.529539  2012         atl
d -0.709172  0.922178      -0.280137  2015         meh

In [33]:
yeniDataFrame.set_index("yeni indeks")

                  yas      maas  calisma saati tarih
yeni indeks
ati          1.086862 -0.801427      -0.547364  2010
zey         -0.258225  0.342008       0.285382  2015
atl          0.439242 -0.906804      -0.529539  2012
meh         -0.709172  0.922178      -0.280137  2015

In [34]:
yeniDataFrame

        yas      maas  calisma saati tarih yeni indeks
a  1.086862 -0.801427      -0.547364  2010         ati
b -0.258225  0.342008       0.285382  2015         zey
c  0.439242 -0.906804      -0.529539  2012         atl
d -0.709172  0.922178      -0.280137  2015         meh

In [35]:
yeniDataFrame.set_index("yeni indeks",inplace=True)

In [36]:
yeniDataFrame

                  yas      maas  calisma saati tarih
yeni indeks
ati          1.086862 -0.801427      -0.547364  2010
zey         -0.258225  0.342008       0.285382  2015
atl          0.439242 -0.906804      -0.529539  2012
meh         -0.709172  0.922178      -0.280137  2015

## multi indeks

In [37]:
ilkIndeks=["simpsom","simpsom","simpsom","south park","south park","south park"]

In [38]:
ikinciIndeks=["homer","bart","marge","cartman","kanny","kyle"]

In [39]:
birlestrilmisIndeks=list(zip(ilkIndeks,ikinciIndeks))

In [40]:
birlestrilmisIndeks

[('simpsom', 'homer'),
 ('simpsom', 'bart'),
 ('simpsom', 'marge'),
 ('south park', 'cartman'),
 ('south park', 'kanny'),
 ('south park', 'kyle')]

In [42]:
birlestrilmisIndeks=pd.MultiIndex.from_tuples(birlestrilmisIndeks)

In [43]:
birlestrilmisIndeks

MultiIndex([(   'simpsom',   'homer'),
            (   'simpsom',    'bart'),
            (   'simpsom',   'marge'),
            ('south park', 'cartman'),
            ('south park',   'kanny'),
            ('south park',    'kyle')],
           )

In [44]:
yeniDatalar=[[10,"a"],[20,"b"],[40,"c"],[10,"d"],[50,"e"],[30,"f"]]

In [45]:
cizgiFilmNpDizisi=np.array(yeniDatalar)

In [46]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNpDizisi,index=birlestrilmisIndeks,columns=["yas","meslek"])

In [47]:
cizgiFilmDataFrame

                   yas meslek
simpsom    homer    10      a
           bart     20      b
           marge    40      c
south park cartman  10      d
           kanny    50      e
           kyle     30      f

In [50]:
cizgiFilmDataFrame.loc["simpsom"]

      yas meslek
homer  10      a
bart   20      b
marge  40      c

In [51]:
cizgiFilmDataFrame.loc["south park"].loc["kanny"]

yas       50
meslek     e
Name: kanny, dtype: object

In [52]:
cizgiFilmDataFrame.index.names=["film adi","isimler"]

In [53]:
cizgiFilmDataFrame

                   yas meslek
film adi   isimler
simpsom    homer    10      a
           bart     20      b
           marge    40      c
south park cartman  10      d
           kanny    50      e
           kyle     30      f